import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_2596;

public class uk extends gk {
   public class_2596 hy;
   public static final MethodHandle[] siw = new MethodHandle[1518813818 * -1253652152 ^ 412646481];
   transient String myMetaphor;

   public uk(class_2596 var1) {
      this.JNT<invokedynamic>(this, var1);
   }

   public static Object _/* $FF was: 1*/(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      MethodHandle var10000 = siw[((var10 ^ 1435097788) - 1228761133 - 1733585611 + 1464612277 - 1731013436 ^ 197063154 ^ 201549530 ^ 2013671679) + 1309882639 - 2008483718];
      if (var10000 == null) {
         int var4 = (Integer)var3[0];
         String var13 = (String)var3[1];
         StringBuilder var10001 = new StringBuilder;
         StringBuilder var10003 = var10001;
         StringBuilder var10002 = var10001;
         String var16 = var13;
         StringBuilder var14 = var10002;
         var10003.<init>(var16);
         int var17 = 812327112 << 1571315933 ^ 0;

         label223:
         while(true) {
            int var18 = var17;
            var10001 = var14;
            int var15 = var18;
            int var19 = var10001.length();
            var10002 = var10001;
            var17 = var19;
            var10003 = var10002;
            var18 = var17;
            var17 = var15;
            var14 = var10003;
            if (var17 >= var18) {
               String var5 = var10003.toString();
               var13 = (String)var3[2];
               var10001 = new StringBuilder;
               var10003 = var10001;
               var10002 = var10001;
               var16 = var13;
               var14 = var10002;
               var10003.<init>(var16);
               var17 = -564773934 + (-1459194611 >>> -589506715) ^ -476156038;

               while(true) {
                  var18 = var17;
                  var10001 = var14;
                  var15 = var18;
                  var19 = var10001.length();
                  var10002 = var10001;
                  var17 = var19;
                  var10003 = var10002;
                  var18 = var17;
                  var17 = var15;
                  var14 = var10003;
                  char var20;
                  if (var17 >= var18) {
                     Class var6 = Class.forName(var10003.toString(), false, uk.class.getClassLoader());
                     var13 = (String)var3[3];
                     var10001 = new StringBuilder;
                     var10003 = var10001;
                     var10002 = var10001;
                     var16 = var13;
                     var14 = var10002;
                     var10003.<init>(var16);
                     var17 = 2019105256 * -2062225873 ^ 2089906584;

                     while(true) {
                        var18 = var17;
                        var10001 = var14;
                        var15 = var18;
                        var19 = var10001.length();
                        var10002 = var10001;
                        var17 = var19;
                        var10003 = var10002;
                        var18 = var17;
                        var17 = var15;
                        var14 = var10003;
                        if (var17 >= var18) {
                           Class var7 = MethodType.fromMethodDescriptorString(var10003.toString(), uk.class.getClassLoader()).returnType();
                           switch(((var4 + 1306141820 + 1317963329 + 585406329 ^ 138395941) + 521116442 ^ 1761437329 ^ 1863105457 ^ 1126214129) - 321807206 + 439156933) {
                           case 544119033:
                              var10000 = var0.findStaticGetter(var6, var5, var7);
                              break label223;
                           case 627822337:
                              var10000 = var0.findGetter(var6, var5, var7);
                              break label223;
                           case 1465658838:
                              var10000 = var0.findSetter(var6, var5, var7);
                              break label223;
                           case 1700281911:
                              var10000 = var0.findStaticSetter(var6, var5, var7);
                              break label223;
                           default:
                              throw new UnsupportedOperationException("Unsupported handle type!");
                           }
                        }

                        var20 = var10003.charAt(var17);
                        var10003.setCharAt(var17, (char)(((((((((((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) & '︀') >> 9 | ((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) << 7) & '\uf800') >> 11 | ((((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) & '︀') >> 9 | ((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) << 7) << 5) - 121 & '\uf000') >> 12 | ((((((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) & '︀') >> 9 | ((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) << 7) & '\uf800') >> 11 | ((((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) & '︀') >> 9 | ((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) << 7) << 5) - 121 << 4) & '쀀') >> 14 | ((((((((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) & '︀') >> 9 | ((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) << 7) & '\uf800') >> 11 | ((((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) & '︀') >> 9 | ((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) << 7) << 5) - 121 & '\uf000') >> 12 | ((((((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) & '︀') >> 9 | ((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) << 7) & '\uf800') >> 11 | ((((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) & '︀') >> 9 | ((((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) & '\uf800') >> 11 | ((((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) & '耀') >> 15 | ((((var20 & '耀') >> 15 | var20 << 1) & '\uffff') >> 0 | ((var20 & '耀') >> 15 | var20 << 1) << 16) << 1) << 5) << 7) << 5) - 121 << 4) << 2) - 116));
                        var17 += 1866345739 * -371323542 * -371323542 ^ -60398899;
                     }
                  }

                  var20 = var10003.charAt(var17);
                  var18 = ((((((var20 & '￠') >> 5 | var20 << 11) & '￼') >> 2 | ((var20 & '￠') >> 5 | var20 << 11) << 14) + 49 - 245 & '￠') >> 5 | ((((var20 & '￠') >> 5 | var20 << 11) & '￼') >> 2 | ((var20 & '￠') >> 5 | var20 << 11) << 14) + 49 - 245 << 11) + 192 + 39 - 21 - 27;
                  int var10004 = (var18 & '耀') >> 15;
                  var19 = var18;
                  var20 = (char)(var10004 | var18 << 1);
                  var14.setCharAt(var17, (char)(var10004 | var19 << 1));
                  var17 += 1336714116 >> 1336714116 ^ 83544633;
               }
            }

            var18 = var10003.charAt(var17) ^ 122;
            var10003.setCharAt(var17, (char)((((((((((var18 & 'ﰀ') >> 10 | var18 << 6) & '\uf000') >> 12 | ((var18 & 'ﰀ') >> 10 | var18 << 6) << 4) ^ 10 ^ 75 ^ 130 ^ 148) & '\uffff') >> 0 | (((((var18 & 'ﰀ') >> 10 | var18 << 6) & '\uf000') >> 12 | ((var18 & 'ﰀ') >> 10 | var18 << 6) << 4) ^ 10 ^ 75 ^ 130 ^ 148) << 16) & 'ﰀ') >> 10 | (((((((var18 & 'ﰀ') >> 10 | var18 << 6) & '\uf000') >> 12 | ((var18 & 'ﰀ') >> 10 | var18 << 6) << 4) ^ 10 ^ 75 ^ 130 ^ 148) & '\uffff') >> 0 | (((((var18 & 'ﰀ') >> 10 | var18 << 6) & '\uf000') >> 12 | ((var18 & 'ﰀ') >> 10 | var18 << 6) << 4) ^ 10 ^ 75 ^ 130 ^ 148) << 16) << 6) ^ 254));
            var17 += 1665889659 << (718856362 | 1665889659 * 718856362) ^ -580993023;
         }
      }

      if (!var11) {
         siw[((var10 ^ 1435097788) - 1228761133 - 1733585611 + 1464612277 - 1731013436 ^ 197063154 ^ 201549530 ^ 2013671679) + 1309882639 - 2008483718] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
